// 日本語UTF-8, LF, Tab=4



/*
// ===================================================================
// 依存ライブラリ
// -------------------------------------------------------------------

// for logger-GSS
// -------------------------------------------------------------------
BetterLog
https://github.com/peterherrmann/BetterLog
プロジェクトキー : MYB7yzedMbnJaMKECt6Sm7FLDhaBgl_dE
version : 27

参考ページ
https://www.monotalk.xyz/blog/google-apps-script-logger%E3%83%A9%E3%82%A4%E3%83%96%E3%83%A9%E3%83%AA-betterlog%E3%82%92%E4%BD%BF%E3%81%86/



// ===================================================================
// ライブラリ基本方針
// -------------------------------------------------------------------

・可能な限り疎結合
・GAS(GoogleのサービスのAPI)機能とJavascriptとしての機能の明示的な分離
・明示的にundefinedを返さない限り矛盾が生じる場合を除き、返り値としてundefinedを返さない



*/



// ===================================================================
// public
// -------------------------------------------------------------------

function SIMPL___Base()
{
}



// ===================================================================
// local
// -------------------------------------------------------------------



